import { forwardRef } from 'react';

export const Conclusion = forwardRef<HTMLDivElement>(({}, ref) => {
  return (
    <section ref={ref} className='section outer'>
      <h2>Вместо заключения</h2>
      <p>
        Есть ещё множество различных сложностей. В веб-разработке они почти не встречаются, но ученые и дата-инженеры
        ведут за них нешуточные бои. В реальной работе чаще всего мы встречаем именно те, которые разобрали здесь:
        константную, линейную, логарифмическую и квадратичную. Остальные сложности — это уже для особых случаев.
      </p>
      <p>
        Главное, что нужно запомнить: Big O — это не про страшную математику, а про то, как быстро код устанет, если
        данных станет слишком много. Это просто способ сказать: «Смотри, этот алгоритм хорош для 10 элементов, а этот —
        для 10 миллионов». Не бойтесь буквы O, она просто помогает выбирать правильный алгоритм.
      </p>
      <p></p>
    </section>
  );
});

Conclusion.displayName = 'Conclusion';
