import { forwardRef } from 'react';

export const Conclusion = forwardRef<HTMLDivElement>(({}, ref) => {
  return (
    <section ref={ref}>
      <h2>Вместо заключения</h2>
      <p>
        Конечно же, это не все сложности оценки алгоритмов. Есть и O(√n), и O(n log n), и совсем страшные (ладно, без
        страшных не обошлось) O(2ⁿ) с O(n!) для рекурсивных переборов, и даже O(n<sup>3</sup>), O(n<sup>4</sup>) для
        самых отчаянных. Но главное, что нужно запомнить: Big O — это не про страшную математику, а про то, как быстро
        код устанет, если данных станет слишком много. Это просто способ сказать: «Смотри, этот алгоритм хорош для 10
        элементов, а этот — для 10 миллионов». Не бойтесь буквы O. Она просто помогает выбирать правильный алгоритм.
      </p>
      <p>
        В реальной работе чаще всего мы встречаем именно те, которые разобрали здесь: константную, линейную,
        логарифмическую и квадратичную. Остальные сложности — это уже для особых случаев.
      </p>
    </section>
  );
});

Conclusion.displayName = 'Conclusion';
