import { nanoid } from 'nanoid';
import { EBlogPostRecord, POSTS_CONFIG_ } from 'src/data/postsConfig';
import { EHeroPattern, EHeroSize } from 'src/components/layout/Hero/Hero.types';
import { TReadingListItem } from 'src/types';
import { renderBookLayout } from 'src/utils/books';
import { getTextWithChevrons } from 'src/utils';
import { LONG_DASH } from 'src/constants';
import { PostWrapper, Spoiler } from 'src/components/blog/';

const goodOmensImage = '/assets/blog/summer-reading-list/good_omens.webp';
const applesDaysImage = '/assets/blog/summer-reading-list/my_apples_days.webp';
const inTheWoodsImage = '/assets/blog/summer-reading-list/in_the_woods.webp';
const theLikenessImage = '/assets/blog/summer-reading-list/the_likeness.webp';
const theSilentPatientImage = '/assets/blog/summer-reading-list/the_silent_patient.webp';
const girlWithKnifeImage = '/assets/blog/summer-reading-list/girl_with_knife.webp';
const sharpObjectsImage = '/assets/blog/summer-reading-list/sharp_objects.webp';

const girlInTheFogImage = '/assets/blog/summer-reading-list/girl_in_the_fog.webp';
const faithfulPlaceImage = '/assets/blog/summer-reading-list/faithful_place.webp';
const sevenTypesImage = '/assets/blog/summer-reading-list/seven_types.webp';
const brokenHarborImage = '/assets/blog/summer-reading-list/broken_harbor.webp';
const theSecretPlaceImage = '/assets/blog/summer-reading-list/the_secret_place.webp';
const trespasserImage = '/assets/blog/summer-reading-list/trespasser.webp';
const everyoneInMyFamilyImage = '/assets/blog/summer-reading-list/everyone_in_my_family.webp';
const everyoneOnThisTrainImage = '/assets/blog/summer-reading-list/everyone_on_this_train.webp';
const everyoneThisChristmasImage = '/assets/blog/summer-reading-list/everyone_this_christmas.webp';
const theDogImage = '/assets/blog/summer-reading-list/the_dog.webp';
const therapistImage = '/assets/blog/summer-reading-list/therapist.webp';
const ahasImage = '/assets/blog/summer-reading-list/ahas.webp';
const limbImage = '/assets/blog/summer-reading-list/limb.webp';
const siloP2Image = '/assets/blog/summer-reading-list/silo_p2.webp';
const siloP3Image = '/assets/blog/summer-reading-list/silo_p3.webp';
const momoImage = '/assets/blog/summer-reading-list/momo.webp';

const Post = () => {
  const JUNE_BOOKS_CONFIG: TReadingListItem[] = [
    {
      id: nanoid(),
      type: 'paperbook',
      title: 'Благие знамения',
      author: 'Нил Гейман, Терри Пратчетт',
      category: ['Зарубежное фэнтези'],
      tags: ['Юмористическое фэнтези'],
      cover: goodOmensImage,
      content: (
        <>
          <p>
            Ещё одна книга, очень долго ждавшая своего часа на полке. Я уже читала как Геймана, так и Пратчетта, но вот
            {getTextWithChevrons('Благие знамения')} у меня вообще не шли несколько лет.
          </p>
          <p>
            Я начинала читать эту книгу не знаю сколько раз, но бросала каждый раз почти что в самом начале. Иронично,
            учитывая сам сюжет книги, но какая-то проклятая книга. Что самое обидное, я люблю такие сюжеты и такой
            стиль, но каждый раз не шло. Но здесь тот случай, когда я скорее готова винить себя {LONG_DASH} просто не
            совпали моё настроение с настроением книги. Может когда-нибудь вернусь к этой книге и перечитаю. Например,
            если всё-таки когда-нибудь возьмусь основательно за цикл {getTextWithChevrons('Плоский мир')} Пратчетта.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Мои яблочные дни',
      author: 'Меллиса да Коста',
      category: ['Зарубежная проза'],
      tags: ['Драма'],
      cover: applesDaysImage,
      content: (
        <>
          <p>
            Главная героиня потеряла мужа и ребёнка, и всю книгу описывается её опыт проживания горя. Но это не самое
            главное. Самое главное это то, что Яндекс.Книги добавили эту книгу в подборку для лёгкого летнего чтения.
            Главная героиня буквально всю книгу борется с депрессией и пытается прожить тяжёлую утрату. Тем временем
            редакторы Яндекс.Книг: ооо, в заголовке яблочные и дни, а ещё в описании героиня переезжает в старинный
            домик, как уютно и лампово, нужно обязательно добавить книгу в летнюю подборку! Видимо для кого-то эта книга
            и будет трогательным приятным чтивом на лето, для меня же эта книга пропитана бесконечной печалью. Вот такие
            вот летние дни, собачка.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'В лесной чаще/В лесу',
      author: 'Тана Френч',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: inTheWoodsImage,
      content: (
        <>
          <p>
            Мне много раз попадалась эта серия в разных детективных подборках. Сейчас я пишу отзыв уже прочитав весь
            цикл про Дублинский отдел убийств, но на момент прочтения только первой книги, была какая-то надежда на
            цикл: тревожное мрачное начало, мощная загадка, двойное убийство в одном месте, ну мёд. Обещали здесь
            ненадёжного расказчика и не обманули. Вообще, ненадёжный рассказчик {LONG_DASH} фишка всего цикла, но именно
            в этой книги его квенсиценция. Детективная составляющая в серии вообще не самая закрученная, но в первой
            книге у меня до последнего не было даже предположений кто окажется убийцей. В остальных книгах цикла всё
            плюс-минус предсказуемо.
          </p>
          <Spoiler label='Осторожно, далее спойлер!'>
            В итоге первая книга закончилась частично открытой развязкой {LONG_DASH} одно из убийств остаётся
            нераскрытым. Видимо Тана Френч отдала решение делать выводы нам, читателям. Что самое худшее можно сделать в
            детективе? Сделать открытую развяку. Как говорится, сидите и …гадайте сами. И не просто сделать открытую
            развязку, а не дать эту разгадку за весь цикл. Была надежда, что в одной из следующих книг вспомнят про это
            дело, но нет. Я не знаю, что мы плохо сделали Тане Френч, что она с нами с так поступила.
          </Spoiler>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Сходство',
      author: 'Тана Френч',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: theLikenessImage,
      content: (
        <>
          <p>
            Книга не просто так называется так, а, видимо, потому, что очень похожа на{' '}
            {getTextWithChevrons('Тайную историю')} Донны Тартт. Причём забавно, что одна из следующих книг в цикле
            называется {getTextWithChevrons('Тайное место')}.
          </p>
          <p>
            {getTextWithChevrons('Сходство')} является продолжением цикла про Дублинский отдел убийств. Главная фишка
            этого цикла в том, что каждая следующая книга рассказывает про нового персонажа, и это всегда кто-то из
            второстепенных персонажей прошлой книги. В этой книге для меня самый интересный главный персонаж из всего
            цикла {LONG_DASH} Кэсси Меддок, но сюжет и само расследование такие вторичные {LONG_DASH} всё это уже было в{' '}
            {getTextWithChevrons('Тайной истории')} и более интереснее. Эта книга для меня слились в одну монокнигу с
            уже упомянутым выше {getTextWithChevrons('Тайным местом')} (про неё будет отзыв далее). Обе книги сильно
            выбиваются из всего цикла, как будто Тана хотела написать конкретные истории, но выпускать отдельно их не
            хотелось и пришлось вписывать в этот цикл, а вышло как не пришей козе баян.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Безмолвный пациент',
      author: 'Алекс Михаэлидес',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: theSilentPatientImage,
      content: (
        <>
          <p>
            Ещё один детектив, который мелькал часто в детективных подборках. Все от него в восторге, в том числе от
            того, что, мол, до конца не подозревали чем закончится. Я же почти с самого начала поняла, что к чему.
            Поэтому книга скорее не понравилась, чем понравилась.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Острые предметы',
      author: 'Гиллиан Флинн',
      category: ['Зарубежная литература'],
      tags: ['Психологический триллер'],
      cover: sharpObjectsImage,
      content: (
        <>
          <p>
            Я обожаю {getTextWithChevrons('Исчезнувшую')} {LONG_DASH} и книгу, и фильм. После серии про дублинский отдел
            убийств и скучного {getTextWithChevrons('Безмолвного пациента')}, захотелось почитать что-то более
            действительно триллерное. И тут я вспомнила, что есть сериал {getTextWithChevrons('Острый предметы')} с Эми
            Адамс, снятый по книге Флинн.
          </p>
          <p>
            Ожидания оправдались на 100%. Из минусов: очень медленно идущий сюжет и слишком быстрая развязка в конце
            буквально на пару глав, но, думаю, здесь это не является таким уж минусом {LONG_DASH} в итоге очень сильно
            окунаешься в атмосферу происходящей дичи. В общем, книга понравилась, но я понимаю, что на мой специфичный
            вкус. Всё-таки я выросла на книгах Паланика и такие сюжеты для меня не проблема. Впечатлительным или людям с
            тонкой душевной организации будет противно читать.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Девушка с ножом',
      author: 'Одри Блейк',
      category: ['Историческая проза'],
      tags: ['Романтика'],
      cover: girlWithKnifeImage,
      content: (
        <>
          <p>
            Никогда такого не было и вот опять {LONG_DASH} ачивка в Яндекс.Книгах заставила меня прочитать очередную
            книгу.
          </p>
          <p>
            Книга про жизнь девушки со скальпелем в Англии середины девятнадцатого века {LONG_DASH} время, когда женщине
            не просто было невозможно стать практикующим врачём, а в целом работающая женщина осуждалась обществом, и
            женщины воспринималась только как придаток к мужу. Истории такого рода всегда очень мотивируют и
            вдохновляют.
          </p>
          <p>
            Книга не претендует на историческую достоверность и медицинскую точность, но я ни историк, ни медик, поэтому
            мне книга понравилась. У неё есть продолжение, начинала его читать, но как-то не пошло, поэтому решила
            отложить до лучших времён.
          </p>
        </>
      ),
    },
  ];

  const JULY_BOOKS_CONFIG: TReadingListItem[] = [
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Девушка в тумане',
      author: 'Донато Карризи',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: girlInTheFogImage,
      content: (
        <>
          <p>
            Моё первое знакомство с этим автором. Идея книги не новая, я бы даже сказала избитая {LONG_DASH} небольшая
            деревушка в горах, пропадает юная девушка, детективу нужно раскрыть дело, бла бла бла. После дублинского
            отдела убийств наконец-то детектив так детектив. Возможно немного нереалистично — ну не может же быть
            столько неадекватных людей в одном месте собраться.
          </p>
          <p>На Донато Карризи крест ставить не буду, попробую как будет настроение почитать что-нибудь ещё от него.</p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Фейтфул-плейс',
      author: 'Тана Френч',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: faithfulPlaceImage,
      content: (
        <>
          <p>
            Опять дублинский отдел убийств. На этой книге я впервые серьёзно задавалась вопросом {LONG_DASH} есть ли
            вообще у нах там в Дублине нормальные люди? Всю книгу я завадалась этим вопросом и чем дальше читала, тем
            жирнее становился знак вопроса.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'paperbook',
      title: 'Семь типов людей, которых можно встретить в книжном магазине',
      author: 'Шон Байтелл',
      category: ['Нон-фикшн'],
      tags: ['Юмор'],
      cover: sevenTypesImage,
      content: (
        <>
          <p>
            Эту книгу я купила в букинистическом магазине в Верхней Пышме (между прочим, самый крупный букинистический
            магазин за Уралом!). Книжка-малышка лежала скромно на этажерке с колёсиками с другими бракованными или
            уценёнными книгам, конкретно эту, очевидно, когда-то намочили и поэтому у неё пошли волной страницы. Я,
            человек который в супермаркете берёт одиночные бананы, чтобы спасти им жизнь, конечно же взяла эту книгу.
          </p>
          <p>
            У меня уже давно лежит в вишлисте {getTextWithChevrons('Дневник книготорговца')} — тоже от этого же автора.
            Насколько я понимаю, {getTextWithChevrons('Семь типов...')} это небольшой спин-офф этой книги. Внутри книги
            юмористический справочник, разбитый по группам и видами читателей. Читала эту книжку я по чуть-чуть, по паре
            глав за раз. Если читать сразу, то можно прочитать за вечер.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Брокен-Харбор',
      author: 'Тана Френч',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: brokenHarborImage,
      content: (
        <>
          <p>
            И вот снова дублинский отдел убийств. После первой книги цикла я бы поставила эту на второе место. Сюжет и
            завязка заинтриговали, но с самого начала были предположения, что будет в развязке. Понравилось как в конце
            сплелись две истории. Если бы сняли по этой книге фильм {LONG_DASH} с удовольствием бы посмотрела.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Тайное место',
      author: 'Тана Френч',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: theSecretPlaceImage,
      content: (
        <>
          <p>
            Опять дублинский отдел убийств. Так же как и {getTextWithChevrons('Сходство')} наименее понравившийся
            детектив из серии. Всю книгу девушки-подростки из закрытой частной школы для девочек, что-то мутят, мутят,
            мутят, мутят и мутят. Главные герои здесь {LONG_DASH} детективы-напарники, {LONG_DASH} как будто даже и не
            нужны были, совершенно потерялись на фоне бесконечных муток подростков.
          </p>
        </>
      ),
    },
  ];

  const AUGUST_BOOKS_CONFIG: TReadingListItem[] = [
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Тень за спиной',
      author: 'Тана Френч',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: trespasserImage,
      content: (
        <>
          <p>
            Месяц новый, а я всё ещё читаю цикл про дублинский отдел убийств. Мне, если честно, было лень выбирать что
            почитать, поэтому я просто пошла по этому циклу. Наверное, если читать его не подряд, у меня было сложилось
            другое мнение, но когда читаешь книгу за книгу, взгляд замыливается и тяжело уже разделить одну от другой.
            Если кратко: сюжет и завязка {LONG_DASH} возможно да, главные герои {LONG_DASH} нет. Детектив Антуаннета
            Конвей выглядит так, будто Тана Френч хотела ввести ещё одну интересную женскую главную героиню наподобии
            Кэсси Меддок, но что-то пошло не так. Развязка {LONG_DASH} для этой серии неожиданная (или на фоне
            предыдущих книг мне это показалось?).
          </p>
          <p>
            Это последняя книга цикла, он официально завершён, и больше всего мне в нём понравилось, что я его дочитала
            до конца. Самое большое разочарование {LONG_DASH} цикл официально закончен, а ответа на вопрос, который
            остался после прочтения первой книги, я так и не получила. Какого-то завершения цикла в самой книге я не
            почувстовала, как будто Тана Френч всё-таки специально так сделала на всякий случай, чтобы потом, если будет
            настроение, вернуться к нему.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'Каждый в моей семье кого-нибудь убил',
      author: 'Бенджамин Стивенсон',
      category: ['Зарубежный детектив'],
      tags: ['Юмор'],
      cover: everyoneInMyFamilyImage,
      content: (
        <>
          <p>
            Совершенно случайно наткнулась на этот детектив, а потом оказалось, что это вообще серия {LONG_DASH}{' '}
            следующие две книги тоже будут из неё. После Дублинского отдела убийств {LONG_DASH} глоток свежего воздуха.
          </p>
          <p>
            Потешный лёгкий детектив, на котором я отдохнула. Постоянно что-то происходит, в какой-то момент если
            отвлечься, то можно вообще заблудиться в сюжете, но мне это даже понравилось. Читала и постоянно думала, что
            было бы здорово посмотреть экранизацию, а потом оказалось, что действительно собираются экранизировать с
            Пенном Бэджли в главной роли. Буду ждать!
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'В этом поезде каждый подозреваемый',
      author: 'Бенджамин Стивенсон',
      category: ['Зарубежный детектив'],
      tags: ['Юмор'],
      cover: everyoneOnThisTrainImage,
      content: (
        <>
          <p>
            Вторая книга из серии про Эрнеста Каннингема. Чуть слабее первой книги, но всё ещё потешный лёгкий детектив.
            Снова интригующая завязка, много персонажей, постоянно что-то происходит. Сюжет вообще сам по себе огромный
            омаж (размером примерно с поезд) на классические английские детективы, в том числе и на Агату Кристи c её
            восточным экспрессом. Для отдыха, в том числе "серьёзных" детективов (например про дублинский отдел убийств,
            хахаха) {LONG_DASH} самое то.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'audiobook',
      title: 'В Рождество у каждого свой секрет',
      author: 'Бенджамин Стивенсон',
      category: ['Зарубежный детектив'],
      tags: ['Юмор'],
      cover: everyoneThisChristmasImage,
      content: (
        <>
          <p>
            Третья книга из серии про Эрнеста Каннингема. Я бы даже сказала вторая с половиной или новогодним спешл.
            Книгу я, конечно же, читала летом в невыносимую жару, стоявшую третий месяц.
          </p>
          <p>
            Обычно такие спешлы, например специальные праздничные серии в сериалах, не несут большой смысловой нагрузки
            и не привносят в сюжет ничего нового. Поэтому можно догадаться, что книга вышла слабее первых двух. Буду
            ждать полноценной третий книги.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Пёс',
      author: 'Иван Токин',
      category: ['Зарубежная проза'],
      cover: theDogImage,
      content: (
        <>
          <p>
            Это какое-то чудо, что я вообще нашла эту книгу. Искала книгу, чтобы скоротать время в долгой дороги по
            Алтаю и хотелось почитать чего-то душевного. Я, казалось, уже перебрала половину Яндекс.книг, как вдруг мне
            попалась эта. Это настолько нишевая книга, что, например, на Livelib на неё вообще нет рецензий. Я не
            понимаю как такое возможно, потому что эта книга даже издаётся в серии Магистрать от Эксмо.
          </p>
          <p>
            В центре сюжета история жизни пса от первого лица. История разбила мне, собачнице, да и вообще неравнодушной
            к животным, сердце. Если вы такой же человек, эта история вас тоже не оставит равнодушным.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Психотерапевт',
      author: 'Бернадетт Энн Перис',
      category: ['Зарубежный детектив'],
      tags: ['Психологический триллер'],
      cover: therapistImage,
      content: (
        <>
          <p>
            Я уже писала, что скептически отношусь к книгам, которые советуют книжные блоггеры, в том числе к этому
            автору. {getTextWithChevrons('Психотерапевт')} и {getTextWithChevrons('За закрытой дверью')} мелькали у
            книжных блогеров просто какое-то неприличное количество раз. Весной я дала шанс Бернадетт Энн Перис и
            прочитала {getTextWithChevrons('Нервный срыв')} и мне не понравилось {LONG_DASH} предсказуемо, главные герои
            плоские и ведут себя шаблонно.
          </p>
          <p>
            Почему я решила дать Бернадетт Энн Перис второй шанс? Потому что нужно было что-то выбрать почитать в поезд,
            хотелось чего-то простого и лёгкого, чего-то что можно будет прочитать в дороге и забыть, и тут я вспомнила
            про эти две книги {LONG_DASH} {getTextWithChevrons('Психотерапевт')} и{' '}
            {getTextWithChevrons('За закрытой дверью')}. Я начала читать {getTextWithChevrons('За закрытой дверью')}{' '}
            {LONG_DASH}
            по описанию понравилось чуть больше, плюс недавно я уже читала {getTextWithChevrons('Безмолвного пациента')}
            и показалось, что будет что-то похожее. Через пару глав чтения я поняла, что где-то я это всё уже читала.
            Полезла проверить и оказалось, что я уже читала эту книгу... Говорю же {LONG_DASH} это книги, которые
            прочитал и забыл. Проверила на всякий случай {getTextWithChevrons('Психотерапевта')}, его, слава богу, не
            читала. К сожалению, сама книга оказалась как и все предыдущие: шаблонной и предсказуемой.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Не ищите апельсины в черничном поле',
      author: 'Джон П.Стрелеки',
      category: ['Нон-фикшн'],
      tags: ['Саморазвитие'],
      cover: ahasImage,
      content: (
        <>
          <p>
            Когда-то давно в переломный момент жизни я прочитала {getTextWithChevrons('Кафе на краю земли')} и
            продолжение {getTextWithChevrons('Возвращение в кафе')}. Обе книги тогда мне понравились потому что сильно
            задели за живое. На тот момент эти книги очень сильно выделялись на фоне других книг по саморазвитию{' '}
            {LONG_DASH} вместо типичной истории успешного успеха автора в первой половине книги и затем перечисления
            сухих одинаковых мотивационных притч, здесь текст имеет сюжетную линию с персонажами.
          </p>
          <p>
            Эта книга попалась случайно, я тут же вспомнила как мне понравились из этой серии истории про кафе, и
            решила, что можно быстренько прочитать и эту. Конечно, сразу понятно, что эта книга будет отличаться от
            историй про кафе. Странно вообще ожидать от книги чего-то, когда прямо на обложке написано, что это сборник
            историй, не связанных между собой каким-то общим сюжетов. Подойдёт для чтения в свободную минутку. Я так и
            читала её {LONG_DASH} по паре историй когда есть время.
          </p>
          <p>
            P.S. Когда искала обложку книги для поста, случайно узнала, что оригинальное название книги{' '}
            {getTextWithChevrons('Ahas! - Moments of Inspired Thought')}, а{' '}
            {getTextWithChevrons('Не ищите апельсины в черничном поле')} {LONG_DASH} адапатация. Вот такие вот дела.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Лимб',
      author: 'Лора Кейли',
      category: ['Зарубежная литература'],
      tags: ['Мистический триллер', 'Психологический триллер', 'Научная фантастика'],
      cover: limbImage,
      content: (
        <>
          <p>
            Я начинала слушать эту книгу несколько раз с самого начала. Первая половина настолько вялодвижущаяся, что я
            в какой-то момент теряла нить повествования и приходилось отматывать назад. Пару раз я даже впервые в жизни
            уснула под аудиокнигу. Со второй половины сюжет пошёл пободрее, но если бы этого не случилось, я бы оставила
            надежду прочитать {getTextWithChevrons('Лимб')}.
          </p>
          <p>
            Задумка интересная, но вторая половина книги по итогу совершенно разочаровала. Начали за здравие — вот вам и
            мистическая атмосфера, и мощный саспенс, и тонкие нотки триллера, и научная фантастика, — а закончили за
            упокой — каким-то янг эдалтом.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Укрытие. Смена',
      author: 'Хью Хауи',
      category: ['Зарубежная фантастика'],
      tags: ['Антиутопия', 'Социальная фантастика'],
      cover: siloP2Image,
      content: (
        <>
          <p>
            Моя любовь к этому циклу началась ещё задолго до того, как был снят одноимённый сериал. И даже до того, как
            появился официальный перевод на русский и серию начали издавать у нас. Я прочитала первую книгу в далёком
            2015 году, найдя её на литмире {LONG_DASH} тогда там можно было скачивать очень много книг бесплатно, а ещё
            было очень много любительских переводов. Собственно, любительский перевод я и прочитала тогда. К сожалению,
            перевода второй книги там не было, какое-то время я ждала его, но потом как-то забылось. Спустя 10 лет после
            этого я случайно узнала, что первую книгу экранизировали, а продолжение цикла давным давном есть в переводе.
          </p>
          <p>
            Пока выходили серии первого сезона, я быстренько прочитала первую и вторую книгу, но запуталась в порядке
            книг {LONG_DASH} в оригинале была совершенно другая разбивка по книгам, из-за чего третью часть {LONG_DASH}{' '}
            {getTextWithChevrons('Пыль')}, {LONG_DASH} я так и не прочитала, и думала, что цикл заканчивается на второй
            книге. Поняла я это когда уже досматривала третий сезон сериала и появился трейлер четвёртого. Срочно
            пришлось навёрстыватать упущенное, но решила перечитать сперва вторую книгу.
          </p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'ebook',
      title: 'Укрытие. Пыль',
      author: 'Хью Хауи',
      category: ['Зарубежная фантастика'],
      tags: ['Антиутопия', 'Социальная фантастика'],
      cover: siloP3Image,
      content: (
        <>
          <p>
            Предыдущую и эту книги я прочитала в рекордные полтора дня. Я очень редко читаю настолько быстро {LONG_DASH}{' '}
            надо чтобы сошлось очень много звёзд. Но тут именно это и произошло. Что могу сказать {LONG_DASH} это один
            из моих любимых циклов книг, а то, что по нему ещё и сняли такой хороший сериал просто чудо. Редко когда
            циклы книг экранизируют, а экранизируют достойно вообще случай 1 из 100. Да, снято не точь-в-точь, но в этом
            случае, на мой взгляд, изменение сценария пошло на пользу, к тому же в сценаристах сериала есть сам автор
            цикла.
          </p>
          <p>С нетерпением буду ждать следующего года и последнего сезона сериала.</p>
        </>
      ),
    },
    {
      id: nanoid(),
      type: 'paperbook',
      title: 'Момо',
      author: 'Михаэль Энде',
      category: ['Детская художественная литература'],
      tags: ['Сказка'],
      cover: momoImage,
      content: (
        <>
          <p>
            Последняя книга, которую я прочитала этим летом. Нравится, что именно она стала последней, есть в этом
            какой-то символизм.
          </p>
          <p>
            Это сказка про девочку Момо, которая противостоит Серым господам, забирающих у взрослых время. Великолепная
            история про взросление и про то, как люди перестают ценить время. Думаю для детей эта история будет слишком
            сложной, а её настоящий смысл поймут только взрослые.
          </p>
          <p>
            Обожаю детскую художественную литературу за то, что часто это что-то большее, чем просто детская книга. У
            меня есть уже целая подборка таких книг, которую я назвала {getTextWithChevrons('Детская недетская проза')}.
            Конечно же {getTextWithChevrons('Момо')} заслуженно была добавлена в эту подборку.
          </p>
          <p>Кстати, эту книгу тоже купила в книжном в Верхней Пышме.</p>
        </>
      ),
    },
  ];

  return (
    <PostWrapper
      postConfig={POSTS_CONFIG_[EBlogPostRecord.SUMMER_READING_LIST]}
      heroConfig={{
        size: EHeroSize.SMALL,
        pattern: EHeroPattern.BOOKSHELF,
      }}>
      <section className='section outer'>
        <p>
          Лето выдалось богатым на книги и пришло время, хоть и с небольшим опозданием, подвести итоги. Первое место по
          жанрам, конечно же, всё ещё держат детективы. Разделение по аудиокнигам и книгам вышло 50 на 50: какие-то
          книги я читала в бумажном виде, какие-то слушала, было много книг, которые начинала как аудиокнигу, а потом не
          хватало терпения и переходила на текстовый вариант.
        </p>
        <p>Книг будет много, поэтому прочитанное разделила по месяцам для удобства.</p>
      </section>
      <section className='section outer'>
        <h2>Июнь</h2>
        {JUNE_BOOKS_CONFIG.map((item) => renderBookLayout(item))}
      </section>
      <section className='section outer'>
        <h2>Июль</h2>
        {JULY_BOOKS_CONFIG.map((item) => renderBookLayout(item))}
      </section>
      <section className='section outer'>
        <h2>Август</h2>
        {AUGUST_BOOKS_CONFIG.map((item) => renderBookLayout(item))}
      </section>
    </PostWrapper>
  );
};

export default Post;
