import { forwardRef } from 'react';
import { CodeSnippet } from 'src/components/blog/CodeSnippet/CodeSnippet';
import { ECodeLang } from 'src/components/common/Code/Code.types';
import { ENoteType, Note } from 'src/components/common/Note';

export const LogComplexity = forwardRef<HTMLDivElement>(({}, ref) => {
  const binarySearchCodeSnippet = `function binarySearch(array: number[], target: number): number {
  let left = 0;
  let right = array.length - 1;

  while (left <= right) {
    const mid = Math.floor((left + right) / 2);

    if (array[mid] === target) return mid;
    if (array[mid] < target) left = mid + 1;
    else right = mid - 1;
  }

  return -1;
}`;

  return (
    <section ref={ref} className='section outer'>
      <h2>Логарифмическая сложность O(log n)</h2>
      <p>
        Сперва вспомним, что такое логарифм. Логарифм — это просто поиск степени. Это вопрос: «В какую степень надо
        возвести одно число, чтобы вышло другое?». Например, возьмём число 2 и возведём его в степень 3, получится 2³ =
        2 × 2 × 2 = 8. Логарифм — делаем всё наоборот: есть результат log<sub>2</sub>8, т.е. надо найти степень, в
        которую нужно возвести 2, чтобы получилось 8. Ответом тут будет 3.
      </p>
      <p>
        Логарифмы бывают разные: двоичные (в основании 2, как в параграфе выше), десятичные (вместо 2 в основании будет
        10) и ещё всякие разные. В логарифмической оценке сложности алгоритмов используется логарифм по основанию 2 т.е.
        двоичные, но основание 2 обычно не пишут: О(log<sub>2</sub>n) эквивалентно О(log n).
      </p>
      <p>
        Теперь можем перейти к логарифмической сложности. Это прекрасная сложность. Скорость выполнения алгоритма здесь
        почти не зависит от размера входных данных. Даже для ОГРОМНЫХ данных такой алгоритм работает очень быстро.
        Каждый шаг уполовинивает задачу. Только представьте: чтобы найти число среди ТРИЛЛИОНА, хватит всего около 40
        попыток потому что log₂(1.000.000.000.000) ≈ 40. Ну разве это не прекрасно? Весь секрет тут именно в основании
        2. Благодаря ему на каждом шаге алгоритма объём работы уменьшается в два раза.
      </p>
      <p>Бинарный поиск — самый известный алгоритм с O(log n):</p>
      <CodeSnippet lang={ECodeLang.TYPESCRIPT} code={binarySearchCodeSnippet} name='binarySearch' />
      <p>Как работает бинарный поиск:</p>
      <p>
        <ol className='list ordered'>
          <li className='list__item'>
            <p>Берём массив и находим на его середину</p>
          </li>
          <li className='list__item'>
            <p>Если искомое число меньше середины — отбрасываем правую половину</p>
          </li>
          <li className='list__item'>
            <p>Если больше — отбрасываем левую половину</p>
          </li>
          <li className='list__item'>
            <p>Повторяем, пока не найдём искомое чисто или не останется элементов</p>
          </li>
        </ol>
      </p>
      <p>
        У массива из 16 элементов будет максимум 4 шага потому что 2⁴ = 16. У массив из 1.000.000 элементов будет
        максимум 20 шагов потому что 2²⁰ ≈ 1 000 000.
      </p>
      <p>Как распознать O(log n) в коде:</p>
      <ul className='list markered'>
        <li className='list__item'>
          <code className='code'>while (left &lt;= right)</code> с делением пополам{' '}
          <code className='code'>(mid = Math.floor((left + right) / 2))</code> (как в бинарном поиске)
        </li>
        <li className='list__item'>рекурсия, которая передаёт половинный диапазон</li>
      </ul>
      <Note>
        <div className='tags'>
          <div className='tag'>Обратите внимание</div>
          <div className='tag TEXT-ONLY'>Сложение сложностей</div>
        </div>
        <p>
          Бинарный поиск работает только для отсортированных массивов. Если массив не отсортирован — нужно его сперва
          отсортировать. Для сортировки выбираем какой-нибудь эффективный алгоритм. Подойдёт, например, быстрая
          сортировка или сортировка слиянием, они работают за O(n log n). Сортировки пузырьком, выбором и вставками,
          которые имеют квадратичную сложность О(n²), брать не имеет смысла — зачем нам замедлять алгоритм?
        </p>
        <p>
          После сортировки у нас пойдёт бинарный поиск со сложность O(log n). На этом этапе у нас есть два
          последовательных алгоритма, первый со сложностью O(n log n), а второй со сложность О(log n). Что делать с ними
          в этом случае?
        </p>
        <p>Есть два правила, которые нужно запомнить на этот случай:</p>
        <ul className='list markered'>
          <li className='list__item'>
            <p>
              <b>Сложности складываются, если алгоритмы выполняются последовательно один за другим.</b> Например:
              <em>
                если есть две независимые части программы, где первая выполняется за O(a), а вторая за O(b), то общая
                сложность будет O(a + b).
              </em>
              .
            </p>
          </li>
          <li className='list__item'>
            <p>
              <b>НО</b>, при сложении двух сложностей всегда выбрасываем ту часть, которая растет медленнее, потому что
              она почти не влияет на общее время работы. Например:{' '}
              <em>
                если есть две независимые части программы, где первая выполняется за O(a), а вторая за O(b), при этом
                первая занимает 20 операций, а вторая 20 миллионов, то общая сложность будет O(b). Почему именно так?
                Потому что, если вы забыли, Big O считает <strong>худший</strong> случай.
              </em>
            </p>
          </li>
        </ul>
        <p>Получается, что выбирая между O(log n) и O(n log n) отбрасывается именно O(log n).</p>
      </Note>
      <Note type={ENoteType.SECONDARY}>
        <div className='tags'>
          <div className='tag'>Обратите внимание</div>
          <div className='tag TEXT-ONLY'>Деление сложностей</div>
        </div>
        <p>
          <p>
            Но можно ли делить сложности? Выдохните — деления сложностей в Big O нет. Алгоритмы не могут делиться друг
            на друга. В реальной жизни операции могут либо идти последовательно (тогда сложности складываются), либо
            вкладываться друг в друга, как циклы (тогда сложности умножаются).
          </p>
          <p>
            Деление есть только как часть самого алгоритма когда мы делим массив пополам и появляется логарифмическая
            сложность.
          </p>
        </p>
      </Note>
    </section>
  );
});

LogComplexity.displayName = 'LogComplexity';
